vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/stm32h503/RTC_reginfo.h
/* This file is generated by stm32_reggen.py from stm32h503xx.h
 * Do not edit this file manually!
 * If corrections are needed, use the
 * override mechanism(s) defined to modify the parsed results
 * and re-run the script to update the file.
 *
 * This file contains the RTC register metadata for the stm32h503 series of chips.
 */

#pragma once
#include "../../stm32_gen_common.h"
static const stm32_reginfo_t stm32_h503_rtc_reginfo[RI_END] =
{
	[RI_TR             ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x007F7F7F }, /* mask = 0b00000000011111110111111101111111 */
	[RI_DR             ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00FFFF3F }, /* mask = 0b00000000111111111111111100111111 */
	[RI_SSR            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFFFFFFFF }, /* mask = 0b11111111111111111111111111111111 */
	[RI_ICSR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00011FFF }, /* mask = 0b00000000000000010001111111111111 */
	[RI_PRER           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x007F7FFF }, /* mask = 0b00000000011111110111111111111111 */
	[RI_WUTR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFFFFFFFF }, /* mask = 0b11111111111111111111111111111111 */
	[RI_CR             ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFFFFFFFF }, /* mask = 0b11111111111111111111111111111111 */
	[RI_PRIVCFGR       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000E00F }, /* mask = 0b00000000000000001110000000001111 */
	[RI_WPR            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x000000FF }, /* mask = 0b00000000000000000000000011111111 */
	[RI_CALR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000F1FF }, /* mask = 0b00000000000000001111000111111111 */
	[RI_SHIFTR         ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x80007FFF }, /* mask = 0b10000000000000000111111111111111 */
	[RI_TSTR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x007F7F7F }, /* mask = 0b00000000011111110111111101111111 */
	[RI_TSDR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000FF3F }, /* mask = 0b00000000000000001111111100111111 */
	[RI_TSSSR          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFFFFFFFF }, /* mask = 0b11111111111111111111111111111111 */
	[RI_ALRMAR         ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFFFFFFFF }, /* mask = 0b11111111111111111111111111111111 */
	[RI_ALRMASSR       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xBF007FFF }, /* mask = 0b10111111000000000111111111111111 */
	[RI_ALRMBR         ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFFFFFFFF }, /* mask = 0b11111111111111111111111111111111 */
	[RI_ALRMBSSR       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xBF007FFF }, /* mask = 0b10111111000000000111111111111111 */
	[RI_SR             ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000007F }, /* mask = 0b00000000000000000000000001111111 */
	[RI_MISR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000007F }, /* mask = 0b00000000000000000000000001111111 */
	[RI_SCR            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000007F }, /* mask = 0b00000000000000000000000001111111 */
	[RI_OR             ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_ALRABINR       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFFFFFFFF }, /* mask = 0b11111111111111111111111111111111 */
	[RI_ALRBBINR       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFFFFFFFF }, /* mask = 0b11111111111111111111111111111111 */
};

